# დავალება 1
# გადაიმეორეთ განვლილი მასალა  პითონში(if, for, while, lists) და ამოხსენით შემდეგი ამოცანები:

# 1)   for loop-ის გამოყენებით დაპრინტეთ 5-ის და 3-ის ჯერადი რიცხვები 1-დან 100-ის ჩათვლით

# 2)  შექმენით ცარიელი სია. მომხმარებელს შეეკითხეთ სახელი და გვარი, რომელსაც დაამატებთ თქვენ მიერ შექმნილ სიაში. საბოლო შედეგი გამოიტანეთ ტერმინალში

# 3)   მომხმარებელს შემოატანიეთ რიცხვი და for loop-ის დახმარებით დაპრინტეთ რიცხვები 1-დან  მომხმარებლის მიერ შემოტანილი რიცხვის ჩათვლით.
# ტერმინალში გამოიტანეთ ამ რიცხვების ჯამი და საშუალო არითმეტიკული

# 4)  შექმენით სია, რომელშიც for ციკლის გამოყენებით შეიტანთ ლუწ რიცხვებს 1-დან 50-ის ჩათვლთ. შედეგი დაფრინტეთ ტერმინალში

# 5)  მომხმარებელს შემოაქვს რიცხვი. შეამოწმეთ არის თუ არა ეს რიცხვი მარტიცი. თუ მარტიცია დაუპრინტეთ "თქვენი რიცხვი მარტივია", სხვა შემთხვევაში დაუპრინტეთ "თქვენი რიცხვი არ არის მარტივი"
# (მარტივი რიცხვი არის ისეთი ნატურალური რიცხვი რომელსაც გააჩნია მხოლოდ ორი გამოყოფი(1 და თავისი თავი))

# 6)  input() ფუნქციის დახმარებით მომხმარებელს შემოაქვს ორი რიცხვი a და b.  შექმენით ცარიელი სია. for ციკლის და range() ფუნქციის გამოყენებით ახალ სიაში  დაამატეთ ყველა რიცხვი რომელიც a და b რიცხვებს შორისაა ( range(a, b) )
# .append() ფუნქციის დახმარებით
# შედეგი გამოიტანეთ ტერმინალში

# 7)  მოცემულია სია my_list = [1, 2, 3, 4, 5, 6, 7, 8 ,9, 10, 11, 12, 13, 14, 15].
# შექმენით პროგრამა რომელიც ამ სიას შეატრიალებს და შედეგად გამოიტანს შემდეგ სიას: 
# [15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1]
# მინიშნება: შექმენით ცარიელი სია.ასევე დაგჭირდებათ for ციკლი,
# რომლითაც გადაუვლით სიაs და ასევე append() ფუნქცია,
# რომლითაც ახალ სიაში დაამატებთ my_list-ს ელ;ემენტებს.
# ასევე დაგჭირდებათ slicing. შედეგი დაპრინტეთ ტერმინალში.



# და მას ეს დავწერე იმიტომ რომ ვერ მივხვდი
# რადგან ვიცი რა რა არის მაგრამ შეკითხვას ვერ ვხვდები რა უნდათ რომ გავაკეთო?